<?php
	
$hap = array(
	"강휘재"=>1,
	"고준수"=>1,
	"구현수"=>0,
	"김강혁"=>0,
	"김동환"=>1,
	"김재경"=>1,
	"김정훈"=>1,
	"문성민"=>0,
	"박준영"=>1,
	"방유빈"=>1,
	"배주영"=>1,
	"신가현"=>1,
	"엄현호"=>1,
	"왕승철"=>1,
	"이건우"=>1,
	"이선빈"=>1,
	"이수호"=>1,
	"이지안"=>0,
	"이진주"=>1,
	"이채미"=>1,
	"이환희"=>1,
	"정민찬"=>1,
	"정헌희"=>1,
	"차준혁"=>1,
	"최현민"=>1,
	"고재훈"=>0,
	"김동훈"=>1,
	"박현주"=>0,
	"박화중"=>0,
	"송광호"=>0,
	"안성재"=>0,
	"양재현"=>0,
	"오승민"=>0,
	"유진우"=>0,
	"이승준"=>0,
	"이승환"=>0,
	"정구현"=>0
                );	

	$names = $_POST["txtName"];

	if($names !== ""){        
    	if($hap[$names] === 1){
			echo "<span style='color:blue;font-size: 22pt;'>". $names . "님은 최종 합격자입니다.</br>축하드립니다.</span> </br><h1>https://open.kakao.com/o/gmWK64E</br> 입장 비밀번호 : n2i0m1d8</h1> ";
        }else{
				echo "<span style='color:orange;font-size: 22pt;'>". $names . "님은 최종 합격자가 아닙니다.</br> 지원한 분들이 많은 관계로 아쉽지만 다음 신입부원 모집에 다시 지원해주시면 감사하겠습니다.";
        }
	}else{
		echo "<span style='color:red;'> 제대로 입력해주세요.";
	}
?>
